//Постфиксная и префиксная формы
//a, b, c, d?
let a = 1, b = 1;
let c = ++a;
let d = b++;

/*
a = 2 => так как ++а
b = 2 => так как b++
c = 2 => так как ++а возвращает новое значение
d = 1 => так как b++ возвращает старое значение до увеличения
*/

//Результат присваивания
let a = 2;
let x = 1 + (a *= 2);
// ответ x = 5 , a = 4

//Преобразование типов
// "" + 1 + 0  => "10"
// "" - 1 + 0 => -1
// true + false  => 1
// 6 / "3"  => 2
// "2" * "3"  => 6
// 4 + 5 + "px"  => "9px"
// "$" + 4 + 5 => "$45"
// "4" - 2 => 2
// "4px" - 2 => NaN
// 7 / 0 => Infinity
// "  -9  " + 5 => "  -9  5"
// "  -9  " - 5 => -14
// null + 1 => 1
// undefined + 1 => NaN
// " \t \n" - 2 => -2
